{
    slug: "common-fax-issues",
    title: "Common Fax Issues",
    subtitle: " ",
    abstract: "",
    created: "7/05/2021",
    updated: "",
    author: {
        name: "Kanasu Nagathihalli",
        picture: "/assets/img/team/kanasu.png",
    },
    content: `
The table below outlines error messages, likely causes and potential workarounds to troubleshoot common fax errors.
| Error | Description | Likely Cause | Workaround |
|---|---|---|---|
| Connection failed	| There was no receiver on the other end of the call to connect to. | The destination is not configured to receive transactions. | Retry, then contact the number to confirm compatibility and connectivity. |
| Document generation error | There was an error while generating the document. This could be because the file was deleted before it was sent. | Internal Service Error | Retry, if the issue persists, contact SIPSTACK support. |
| Failed to train with any of the compatible modems | A remote fax machine was deleted but the sending and receiving modems could not establish communication. | Connectivity Issues | Retry, if the issue persists, contact SIPSTACK support. |
| Fax transmission not established | This could be because either no fax machine was detected at the receiving end or there was a lack of call clarity. | Connectivity issues, Carrier issues, T.38 Incompatibility issue | Retry, then determine whether remote side was configured for T.38. |
| Long entry lost | The call started but the log entry for the call was lost or incomplete. In practice, this is rate, and may indicate a system-wide problem. | Internal Service Error | Retry, if the issue persists, contact SIPSTACK support. |
| No response after sending a page | The remote fax machine did not acknowledge that it received a page of the fax. Depending on the remote machine’s behavior, it may still have printed the page and any preceding pages. | Connectivity issues | Retry, then contact destination to ensure delivery. |
| Received no response to DCS or TCF | The bulk fax service could not successfully determine the remote machine’s fax capabilities. | T.38 Incompatibility issue | Determine whether remote side was configured for T.38. |
| The call dropped prematurely | The call dropped due to a non-fax transmission error. It is likely that the receiver hung up. | **Inbound:** The destination is a voice number or is not set up to receive faxes. **Outbound:** The destination is a voice number, or the destination rings for so long that the transmission times out before the handshake can be established. | Retry |
| The HDLC carrier did not stop in a timely manner | The fax service initiated a fax transmission with the receiver, but there was a synchronization (timing) error that could not be resolved. | Likely low-quality routes. | Retry, if network conditions persist, contact SIPSTACK support so we can contact our carrier partner for additional insight. |
| Timed out waiting for initial communication | A call was established with the receiver, and the bulk fax service attempted to establish a fax session. However, there was no fax response from the receiver. This could be due to there being no fax machine on the receiving end or a lack of call clarity. | No remote fax machine or poor-quality routes | Retry, if network conditions persist, contact SIPSTACK support so we can contact our carrier partner for additional insight. |
| Unexpected DCN while waiting for DCS or DIS | The remote fax machine unexpectedly sent a disconnect message when the fax service asked for the remote fax machine’s fax capabilities. | T.38 Incompatibility issue | Determine whether remote side was configured for T.38 only. |
| Disconnected after permitted retries | The fax service attempted to send the same message multiple times unsuccessfully. this may be due to a call clarity issue. | Poor network conditions | Retry, if network conditions persist, contact SIPSTACK support so we can contact our carrier partner for additional insight. |
| Far end cannot receive at the resolution of the image | The remote fax machine does not have the capability to support faxes in that resolution. | Quality is too high | Try lowering quality and resend fax. |
| Received a DCN from remote after sending a page | The remote fax machine responded with a disconnect message after a page was sent successfully. Depending on the remote machine’s behavior, it may have still printed the sent page and any preceding pages. | Poor network conditions | Retry, if network conditions persist, contact SIPSTACK support so we can contact our carrier partner for additional insight. |
| Unexpected message received | The fax service received a message that it did not expect given the current context. | Protocol failure | Determine whether the expected number of pages matches the number of successfully transmitted pages. Failure may have been in tearing down the call. |
| Unexpected DCM after EOM or MPS sequence | The remote fax machine disconnected unexpectedly after receiving a page of a multi-page fax. Depending on the remote machine’s behavior, it may have still printed the sent page and any preceding pages. | Poor network conditions | Retry, if network conditions persist, contact SIPSTACK support so we can contact our carrier partner for additional insight. |
| Document loading error | The fax service attempted to generate the message to send, but a document was missing. | Internal service error | Retry, if the issue persists, contact SIPSTACK support. |
| Invalid ECM response received from receiver | The fax service received an invalid error correction message from the remote fax machine. | T.38 Incompatibility issue | Retry, if failures only occur with one number, there’s a chance that the remote fax machine is incompatible with our infrastructure. |
| Unexpected DCN after RR/RNR sequence | The remote fax machine disconnected unexpectedly after indicating that it was not ready to initiate a fax session. | Unexpected failure | Retry, if failures only occur with one number, there’s a chance that the remote fax machine is incompatible with our infrastructure. |
*Table 1*
**Notes:**

1. SIPSTACK only supports faxes sent using the T.30 protocol.
2. SIPSTACK fax only supports the transmission of PDFs to Fax-enabled destinations.

`
},