{
    slug: "glossary",
    title: "SIPSTACK Glossary",
    subtitle: "A comprehensive and growing list of all things SIPSTACK.",
    abstract: "",
    created: "04/11/2022", 
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
[**Brand**](https://www.sipstack.com/resources/docs/partner-portal)  
Your brand is the domain that you have registered with SIPSTACK, you can create multiple brands within your [partner portal]( https://www.sipstack.com/resources/docs/partner-portal).   
[**Carrier**](https://www.sipstack.com/resources/docs/smart-cnam)  
The telecom provider of the incoming caller is provided when using the Telco/Carrier lookup tool in Smart CNAM.  
[**Cloud UC**]( https://www.sipstack.com/products/cloud-uc)  
Cloud **U**nified **C**ommunications is an Asterisk based, open source platform, that allows you to scale and manage from a single console.  
[**Domain**](https://www.sipstack.com/resources/docs/smart-cnam)  
The name of the website belonging to the incoming caller is provided when using the Domain lookup tool in Smart CNAM.   
[**Lookup**](https://www.sipstack.com/resources/docs/smart-cnam)  
The Lookup types offered by Smart CNAM offer the following up to date information: Risk score, Caller ID, Regional, Telco/Carrier, Online Profiles.     
[**Message SSID**](https://www.sipstack.com/resources/knowledge-base/text-messaging/what-is-a-message-ssid)   
Every message successfully created by SIPSTACK API generates a unique SSID. The SSID is a 34-character string.  
[**Partners**](https://www.sipstack.com/products/smart-cnam#faqs)  
Partners are typically telecom related entities that create an account with SIPSTACK and integrate our products into their call flows.   
[**Region**](https://www.sipstack.com/resources/docs/smart-cnam)  
Region describes the following information of the incoming caller when using the Regional lookup tool in Smart CNAM: city, region (province/territory/state) and country.   
[**SIPSTACK Cookie Policy**](https://www.sipstack.com/legal/privacy)  
Read our cookie policy, an exhaustive list of all the cookies used to enhance your user experience, before using our products of services.   
[**SIPSTACK Partner Account**](https://www.sipstack.com/resources/docs/partner-portal)   
Creating an account makes you a SIPSTACK partner, and gives you access to our ever-evolving suite of products.  
[**SIPSTACK Partner Portal**](https://www.sipstack.com/resources/docs/partner-portal)   
The SIPSTACK Partner Portal is the central hub that gives you access to all the products in the SIPSTACK ecosystem.   
[**SIPSTACK privacy policy**](https://www.sipstack.com/legal/privacy)   
Read our privacy policy, that outlines how we securely manage your private information, before using our products or services. 
[**SIPSTACK terms of service**](https://www.sipstack.com/legal/tos)  
Read and agree with our terms of service, that outlines our responsibilities as a service provider, as well as user obligations, before using our products or services.   
[**Smart CNAM**](https://www.sipstack.com/resources/docs/smart-cnam)  
Smart **C**aller **Nam**e is the next generation lookup tool. Smart CNAM goes way beyond just a name response and can include a tremendous amount of information when requested.  
[**Source/Risk score**](https://www.sipstack.com/resources/docs/smart-cnam)  
SIPSTACK's proprietary algorithm uses artificial intelligence and machine learning to uniquely weigh a number of factors to determine a safety score assigned to each individual call.  
[**Users**](https://www.sipstack.com/resources/docs/partner-portal)  
Users of an organization are authorized and given access through the SIPSTACK Partner Portal.  
[**Vertical**](https://www.sipstack.com/products/smart-cnam#faqs)  
Vertical markets may not have a destination number to provide however, may wish to receive caller information. They can do so without a destination number for a minimial cost.   
[**Whois**](https://whois.sipstack.com/)  
Whois is the world’s most advanced lookup tool, proving information and trust ratings based on the incoming Caller ID number.  
[**Whois Profiles**](https://www.sipstack.com/resources/docs/partner-portal)  
Whois profiles is a directory containing phone numbers that you own, and any relevant information. Registering a number allows you to enhance the score rating of those phone numbers, as well as utilize the Source/Risk lookup function.  

`
},

{
    slug: "understanding-wangiri-fraud",
    title: "Understanding Wangiri Fraud?",
    subtitle: "Wangiri is a Japanese term that translates to one ring and cut, referring to a phone call that rings just one time before disconnecting.",
    abstract: "",
    created: "26/10/2022", //dd/mm/yyyy
    updated: "",
    author: {
        name: "Jeff Sager",
        picture: "/assets/img/team/jeffsa.jpg",
    },
    content: `
Canadians have reported losses of $383 million in 2021 alone to telecommunication fraud, costing victims exponentially more money than ever before.<sup>1</sup> As spam calling and texting has become a growing concern, it’s important to be aware of the prevalent scams both in the [US](https://www.sipstack.com/resources/blog/the-state-of-spam-calling-in-the-US) and [Canada](https://www.sipstack.com/resources/blog/the-state-of-spam-calling-in-canada). Increased awareness helps protect ourselves and loved ones against fraud. One of the most prevalent of these telecommunications scams is called Wangiri.  

Wangiri is a Japanese term that translates to _one ring and cut_, referring to a phone call that rings just one time before disconnecting. Typically, these calls will occur at nighttime or working hours in order to intentionally go unanswered and be displayed as a missed call in the call log. The intention is to have victims call the number back, which is then re-routed to an IPRN, International Premium Rate Number, or another number that charges excessively high fees.<sup>2</sup>  Oftentimes, victims receive multiple calls from the same premium-rate number, or even text messages, to influence them to call the number back.<sup>3</sup> This is known as the first leg of the Wangiri attack.  

The second leg occurs once the victim actually calls the number back. The motivation of the scammer then becomes to keep the caller on the line for as long as possible. To this end, they typically use a recording centered around a lottery win, gambling, or other adult-themed content to entice the victim to stay on the line.<sup>4</sup> The longer the call is, the more expensive the fees are, most of which are paid to the scammer.
 

## Signs of a Wangiri Call
Here are a few telltale signs to look out for:
1)	The phone will ring for only a short amount of time before disconnecting.
2)	The call occurs at nighttime or working hours.
3)	The number has an unusual international country code.

## Takeaways and Tips to Protect Yourself
Keep the following in mind to keep yourself safe against Wangiri fraud:
1)	If you notice you have a missed call from a number unfamiliar to you, do not call back. As tempting as it may be to want to know whose call you missed, it’s important to remember that legitimate callers trying to reach you will often leave a voicemail.
2)	If you are receiving a lot of these calls, report it to your phone provider. 
3)	If you have already been charged for calling one of these numbers back, you can report the crime to the police.<sup>5</sup>


#### References
<sup>1 <a href="https://www.antifraudcentre-centreantifraude.ca/index-eng.htm" target="_blank">https://www.antifraudcentre-centreantifraude.ca/index-eng.htm</a></sup>  
<sup>2 <a href="https://www.enghousenetworks.com/enghouse-resources/blog/infographics/detect-protect-against-wangiri-callback-fraud" target="_blank">https://www.enghousenetworks.com/enghouse-resources/blog/infographics/detect-protect-against-wangiri-callback-fraud</a></sup>   
<sup>3 <a href="https://www.europol.europa.eu/sites/default/files/documents/wangiri_final_2.pdf" target="_blank">https://www.europol.europa.eu/sites/default/files/documents/wangiri_final_2.pdf</a></sup>   
<sup>4 <a href="https://abhandshake.com/wangiri" target="_blank">https://abhandshake.com/wangiri</a></sup>   
<sup>5 <a href="https://www.europol.europa.eu/sites/default/files/documents/wangiri_final_2.pdf" target="_blank">https://www.europol.europa.eu/sites/default/files/documents/wangiri_final_2.pdf</a></sup>  
`
},

{
    slug: "what-is-cnam",
    title: "What is CNAM?",
    subtitle: "Simply put, CNAM is the Caller Name of an incoming phone call. This is displayed on the screen of a mobile or home device.",
    abstract: "",
    created: "22/09/2022", 
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
Simply put, CNAM is the **C**aller **Nam**e of an incoming phone call. This is displayed on the screen of a mobile or home device. The 15 available characters are indicative of either an individual or an organization. <sup>1</sup> CNAM presents itself in replacement of, or in accompaniment with CLID, **C**aller **ID**. Caller ID is the phone number of an incoming phone call.

## Why does it exist?

There is a variety of fraudulent scams that are rapidly advancing within the ever evolving sphere of telecommunications. A common misconception is that the majority of victims are seniors, given their vulnerable status. Yet millennials are also largely targeted, given the rise in cell phone owners and decline of land line owners. <sup>2</sup>

A 2014 survey revealed that within the last 12 months, in the United States alone, over $8.6 billion dollars were lost to phone fraud.<sup>3</sup> As a result, people have grown distrustful and no longer feel safe answering unknown numbers. Important and relevant calls are missed due to the fear of falling prey to a scam call.

Preventative measures, such as CNAM, work to provide callers with a sense of security.

## Not sure a call is safe?

CNAM is not an automated feature granted to cellphone users. Additionally, there is no centralized database, meaning the name displayed may vary depending on the database chosen by the receiver’s carrier. That is where Whois comes in! If an unknown number is attempting to contact you, and you aren’t sure whether it is safe, use [Whois](https://whois.sipstack.com/) by SIPSTACK. By entering the Caller ID displayed, you will be able to receive reliable information on the security level of the number.

#### References
<sup>1 [https://rdi-it.com/user-guides/the-basics-of-caller-id/](https://rdi-it.com/user-guides/the-basics-of-caller-id/)</sup>  
<sup>2 Tabron, Judith L. _Creating urgency in tech support scam telephone conversations_. Hofstra University, 2016.</sup>  
<sup>3 [https://today.com/money/americans–lost–8–6–billion–phone–fraud–last–year–survey–1D80108259](https://today.com/money/americans–lost–8–6–billion–phone–fraud–last–year–survey–1D80108259)</sup>  

`
},

{
    slug: "risk-score",
    title: "What do Score/Risk Calculations mean?",
    subtitle: "Our Smart CNAM's 'Risk Score' allows requestions to interpret the score of a calling phone number.",
    abstract: "",
    created: "04/11/2022", 
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
Amongst the various [Smart CNAM lookup types](https://www.sipstack.com/resources/docs/smart-cnam), the score/risk lookup function provides a dynamic score on a scale from 0.000-5.000.  SIPSTACK's proprietary algorithm uses artificial intelligence and machine learning to uniquely weigh a number of factors to determine the score assigned to each call. It is important to note that carriers have internal scores, contributing to the risk calculations. As the carrier continues to interact with our [partner portal]( https://www.sipstack.com/resources/docs/partner-portal), [cloud UC]( https://www.sipstack.com/products/cloud-uc) and continue to use other services, their internal score will go up. This strengthens the trust behind their clients’ phone numbers and as a result, provide their clients with higher scores. Conversely, deceitful actions of the carrier, not only lowers the carrier’s score but all of their clients scores as well. The algorithm is ever-evolving to provide the best possible security to our customers. 

| Score | Remarks| 
|---|---|   
| <1  | Blacklisted |  
| 1-1.499 | Fraud |  
| 1.5-1.999 | Spam |  
| 2-2.499 | Spam Likely |  
| 2.5-3 | Spam Possible/Recovering |  
| 3-4 | Safe |  
| 4-5 | Trusted |  

*Table 1 - SIPSTACK's suggested remarks based on score ranges*


### Steps to take 
Carriers can determine their own safety threshold, in relation to the risk calculations and offer customers the option to block calls below this threshold. Alternatively, carriers can let individual customers determine what score they deem is safe, for their unique needs, and block calls below their individually determined safety threshold. Remarks associated with our risk calculations are automatically provided to the carrier, in association with the score. Carriers can display these to their customers at their discretion. Ultimately, SIPSTACK allows individual carriers to interpret scores and determine safety thresholds independently. 

Visit Smart CNAM product documentation to [learn more](https://www.sipstack.com/resources/docs/smart-cnam) or [contant us](https://www.sipstack.com/contact/us).

`
},

{
    slug: "what-is-enhanced-911",
    title: "What is Enhanced 911?",
    subtitle: "Enhanced 911 or E-9-1-1 is a system utilized in North America that provides the caller's location to emergency services.",
    abstract: "",
    created: "02/11/2022",
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
Enhanced 911 or E-9-1-1 is a system utilized in North America that provides the caller’s location to emergency services. 9-1-1 dispatchers are able to retrieve physical addresses of landlines, and geographic coordinates of wireless callers, which is then passed on to police officers, firefighters, paramedics, and other services as deemed fit. Enhanced location information works to improve the effectiveness and reliability of wireless 911 services.  

### Canada mandates the following from local [VoIP service providers](https://www.sipstack.com/resources/blog/voip-technology-explained): 

1. To provide either basic or E-9-1-1 service to their customers.    
2. To provide customers with adequate and accessible notifications of any service limitations with respect to their 9-1-1 or E-9-1-1 services.    
3. To register with the **CRTC**, **C**anadian **R**adio-television and **T**elecommunications **C**ommission, as a reseller. If the company owns and controls transmission facilities, it has to register with the Commission as a **CLEC**, **C**ompetitive **L**ocal **E**xchange **C**arrier.    
4. To obtain a **BITS**, **B**asic **I**nternational **T**elecommunication **S**ervice, license from the CRTC, if the company operates internationally.  
5. Companies are required to keep up to date with all ongoing regulatory filings to maintain their BITS license and registration. Failure to do so could lead to deregistration and loss of the BITS license.  

Having a hard time keeping up to date with ever-evolving mandatory guidelines and regulations as a carrier? [Contact us]( https://www.sipstack.com/contact/us) today and we will make sure you are exceeding industry standards in building a secure connected tomorrow.  

`
},
