{
    slug: "what-is-cnam",
    title: "What is CNAM?",
    subtitle: "Simply put, CNAM is the Caller Name of an incoming phone call. This is displayed on the screen of a mobile or home device.",
    abstract: "",
    created: "22/09/2022", 
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
Simply put, CNAM is the **C**aller **Nam**e of an incoming phone call. This is displayed on the screen of a mobile or home device. The 15 available characters are indicative of either an individual or an organization. <sup>1</sup> CNAM presents itself in replacement of, or in accompaniment with CLID, **C**aller **ID**. Caller ID is the phone number of an incoming phone call.

## Why does it exist?

There is a variety of fraudulent scams that are rapidly advancing within the ever evolving sphere of telecommunications. A common misconception is that the majority of victims are seniors, given their vulnerable status. Yet millennials are also largely targeted, given the rise in cell phone owners and decline of land line owners. <sup>2</sup>

A 2014 survey revealed that within the last 12 months, in the United States alone, over $8.6 billion dollars were lost to phone fraud.<sup>3</sup> As a result, people have grown distrustful and no longer feel safe answering unknown numbers. Important and relevant calls are missed due to the fear of falling prey to a scam call.

Preventative measures, such as CNAM, work to provide callers with a sense of security.

## Not sure a call is safe?

CNAM is not an automated feature granted to cellphone users. Additionally, there is no centralized database, meaning the name displayed may vary depending on the database chosen by the receiver’s carrier. That is where Whois comes in! If an unknown number is attempting to contact you, and you aren’t sure whether it is safe, use [Whois](https://whois.sipstack.com/) by SIPSTACK. By entering the Caller ID displayed, you will be able to receive reliable information on the security level of the number.

#### References
<sup>1 [https://rdi-it.com/user-guides/the-basics-of-caller-id/](https://rdi-it.com/user-guides/the-basics-of-caller-id/)</sup>  
<sup>2 Tabron, Judith L. _Creating urgency in tech support scam telephone conversations_. Hofstra University, 2016.</sup>  
<sup>3 [https://today.com/money/americans–lost–8–6–billion–phone–fraud–last–year–survey–1D80108259](https://today.com/money/americans–lost–8–6–billion–phone–fraud–last–year–survey–1D80108259)</sup>  

`
},

{
    slug: "what-is-enhanced-911",
    title: "What is Enhanced 911?",
    subtitle: "Enhanced 911 or E-9-1-1 is a system utilized in North America that provides the caller's location to emergency services.",
    abstract: "",
    created: "02/11/2022",
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
Enhanced 911 or E-9-1-1 is a system utilized in North America that provides the caller’s location to emergency services. 9-1-1 dispatchers are able to retrieve physical addresses of landlines, and geographic coordinates of wireless callers, which is then passed on to police officers, firefighters, paramedics, and other services as deemed fit. Enhanced location information works to improve the effectiveness and reliability of wireless 911 services.  

### Canada mandates the following from local [VoIP service providers](https://www.sipstack.com/resources/blog/voip-technology-explained): 

1. To provide either basic or E-9-1-1 service to their customers.    
2. To provide customers with adequate and accessible notifications of any service limitations with respect to their 9-1-1 or E-9-1-1 services.    
3. To register with the **CRTC**, **C**anadian **R**adio-television and **T**elecommunications **C**ommission, as a reseller. If the company owns and controls transmission facilities, it has to register with the Commission as a **CLEC**, **C**ompetitive **L**ocal **E**xchange **C**arrier.    
4. To obtain a **BITS**, **B**asic **I**nternational **T**elecommunication **S**ervice, license from the CRTC, if the company operates internationally.  
5. Companies are required to keep up to date with all ongoing regulatory filings to maintain their BITS license and registration. Failure to do so could lead to deregistration and loss of the BITS license.  

Having a hard time keeping up to date with ever-evolving mandatory guidelines and regulations as a carrier? [Contact us]( https://www.sipstack.com/contact/us) today and we will make sure you are exceeding industry standards in building a secure connected tomorrow.  

`
},
