{
    slug: "what-is-A2P-10DLC",
    title: "What is A2P 10DLC?",
    subtitle: "A2P, Application-to-Person, messaging in the United States allows businesses to leverage a preapproved 10DLC, 10 Digit Long Code, a phone number, to send mass text messages to consumers .",
    abstract: "",
    created: "14/10/2022", //dd/mm/yyyy
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
**A2P**, Application-to-Person, messaging in the United States allows businesses to leverage a preapproved **10DLC, 10 D**igit **L**ong **C**ode, a phone number, to send mass text messages to consumers. Businesses can register with carriers whom work with **TCR** [**T**he **C**ampaign **R**egistry](https://www.campaignregistry.com/) to offer integrated registration for approval, or directly with the TCR themselves. Businesses must acquire approval for both their brand and each campaign as per **CITA**, **C**ellular **T**elecommunications and **I**nternet **A**ssociation guidelines, in the larger effort to increase transparency in the telecommunication ecosystem.

## Existing Alternatives

While 10DLC is not the only option for businesses, each alternative comes with its own caveats.

**Toll-free long codes**: While 1-800 numbers are an affordable option with a high throughput rate of thousands a day, it requires a separate step of obtaining approval for the third party number. Additionally, using a toll-free number significantly reduces customer engagement and experience as it appears impersonal and foreign to consumers.

**Short codes**: While using this 5/6 digit option has an impressive throughput rate of millions a day, purchasing short codes is an expensive ordeal. Acquiring approval for short codes is a long process, unfit for today’s fast paced trends.

**Local long codes**: Standard phone numbers come at no additional cost, but with little applicability. As they are not designed for A2P but rather **P2P** **P**erson-to-**P**erson use, the throughput rate is significantly lower, sitting at a few hundred a day. More importantly A2P messaging with unapproved long codes is against CITA, guidelines and so these unsanctioned texts are often filtered out by carriers.

## Benefits of 10DLC

A2P 10DLC offers a happy medium of mass text messaging management with low overhead costs, providing an accessible option to US businesses. While allotted throughput is dependent on a Trust Score assigned upon registration, its capacity is still impressively sitting in the thousands between toll-free long codes and short codes. Compliance with CITA guidelines improves deliverability rates but also brand image and reputation. A2P 10DLC enables campaign data management through tracking keyword performance, allowing for better business practices. Businesses are able to use an exisiting [dedicated phone number](https://www.sipstack.com/resources/blog/dedicated-phone%20number), translating to quick approval times and reduced costs. Ultimatly, utilizing A2P 10DLC significantly improves customer engagement and experiences.

`
},

{
    slug: "what-is-stir-shaken",
    title: "What is STIR/SHAKEN?",
    subtitle: "STIR/SHAKEN are two separate initiatives that work to verify the identity of an inbound call in efforts to deter illegal caller ID spoofing.",
    abstract: "",
    created: "22/09/2022",
    updated: "",
    author: {
        name: "Anjana Uthayakumaran",
        picture: "/assets/img/team/anjanaa.jpg",
    },
    content: `
STIR/SHAKEN are two separate initiatives that work to verify the identity of an inbound call in efforts to deter illegal caller ID spoofing. **STIR,** **S**ecure **T**elephony **I**dentity **R**evisited, and **SHAKEN**, **S**ignature-based **H**andling  of **A**sserted  information using  to**KENs**  are mandated in North America. Since its origin in 2020 <sup>1</sup>, governing bodies **CRTC**, **C**anadian **R**adio-television and **T**elecommunications **C**ommission, and the **FCC** **F**ederal **C**ommunications **C**ommission will oversee its implementation and maintenance.

## A Little Bit About Illegal Caller ID Spoofing

Spoofing, as the name suggests, is the intentional act of tricking someone. In the context of telecommunications, it involves disguising the original  [CNAM, **C**aller **NAM**e, and/or CID, **C**aller **ID**. ](https://www.sipstack.com/resources/knowledge-base/general/what-is-cnam)  Opting for a private or unknown caller CNAM will warrant at best, a 19% answering rate in the U.S.  <sup>2</sup>. Scammers armed with this knowledge, utilize the CID of other individuals and companies, without permission. This illegal activity damages the reputation of major companies and organization, creates more fear and hesitancy around answering calls and, increases the efficacy of fraud.

## How Does It Work?

STIR leverages three levels of verification, corresponding to different levels of security, to determine whether a call should be trusted via [VoIP](https://www.sipstack.com/resources/blog/voip-technology-explained) systems. This technology verifies information at several points in the call, disabling hackers from beating this authentication system. SHAKEN was created to address non-VoIP systems, such as the conventional cellphone. This results in providing the user with verified information, appended with tags such as *verified* or *no verification*. Note that messages may differ across devices and carriers types.

## Does this mean I am safe from spoofing?

The short answer is no. STIR/ SHAKEN aids to verify a call, but does not prevent or block unverified calls.

STIR/SHAKEN guidelines have yet to be fully implemented in North America. Canada is in the beginning stages of implementation, while in the U.S., the FCC has granted extensions up until June 2023 for carriers with fewer than 100,000 subscribers <sup>3</sup>.  Additionally, numbers can only be verified if the device is compatible, and both carriers have adopted the guidelines.

To learn more about protecting your company’s number from getting spoofed visit [SIPSTACK](https://www.sipstack.com/). 

#### References
<sup>1 [https://www.fcc.gov/call-authentication](https://www.fcc.gov/call-authentication)</sup>
<sup>2 McClain, Colleen. "Most Americans don’t answer cellphone calls from unknown numbers." (2020).</sup>
<sup>3 [https://www.fcc.gov/call-authentication](https://www.fcc.gov/call-authentication)</sup>

`
},
